In [31]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [113]:
#DATASET1
df=pd.read_csv(r"C:\Users\pc\Desktop\__pycache__\ds_salaries.csv.xls")

In [114]:
df

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

In [115]:
df.describe()

       Unnamed: 0    work_year        salary  salary_in_usd  remote_ratio
count  607.000000   607.000000  6.070000e+02     607.000000     607.00000
mean   303.000000  2021.405272  3.240001e+05  112297.869852      70.92257
std    175.370085     0.692133  1.544357e+06   70957.259411      40.70913
min      0.000000  2020.000000  4.000000e+03    2859.000000       0.00000
25%    151.500000  2021.000000  7.000000e+04   62726.000000      50.00000
50%    303.000000  2022.000000  1.150000e+05  101570.000000     100.00000
75%    454.500000  2022.000000  1.650000e+05  150000.000000     100.00000
max    606.000000  2022.000000  3.040000e+07  600000.000000     100.00000

In [116]:
salary_mean=df['salary'].mean()
salary_mean

324000.0626029654

In [117]:
salary_std=df['salary'].std()
fst_std_upperbound= salary_mean + salary_std
print(fst_std_upperbound)
fst_std_lowerbound=salary_mean - salary_std
print(fst_std_lowerbound)

1868357.5492388173
-1220357.4240328865

COEFFICIENT OF VARIANCE

In [118]:
cv= salary_std/salary_mean
cv

4.766534531594616

In [119]:
salary_usd_mean=df['salary_in_usd'].mean()
print(salary_usd_mean)
salary_usd_std=df['salary_in_usd'].std()
print(salary_usd_std)

112297.86985172982
70957.2594113957

In [120]:
fst_std_upperbound= salary_usd_mean + salary_usd_std
print(fst_std_upperbound)
fst_std_lowerbound=salary_usd_mean - salary_usd_std
print(fst_std_lowerbound)

183255.12926312553
41340.610440334116

In [121]:
cv_usd= salary_usd_std/salary_usd_mean
cv_usd

0.6318664771209166

In [122]:
print(f"Coefficient of variation for the Dollar: {cv_usd}")
print(f"Coefficient of variation for the Rupee: {cv}")

Coefficient of variation for the Dollar: 0.6318664771209166
Coefficient of variation for the Rupee: 4.766534531594616

Quartiles \ Quantiles

In [123]:
Q1 = np.quantile(df['salary'],q=0.25) 
print(Q1)
Q2 = np.quantile(df['salary'],q=0.50) 
print(Q2)
Q3 = np.quantile(df['salary'],q=0.75) 
print(Q3)
Q4 = np.quantile(df['salary'],q=1) 
print(Q4)

70000.0
115000.0
165000.0
30400000

IQR - INTER QUARTILE RANGE

In [124]:
IQR = Q3-Q1
IQR

95000.0

QCD - QUARTILE COEFFICIENT OF DISPERSION

In [125]:
QCD = Q3-Q1/Q3+Q1
QCD

234999.57575757575

In [126]:
#salary_in_usd
Q1 = np.quantile(df['salary_in_usd'],q=0.25) 
print(Q1)
Q2 = np.quantile(df['salary_in_usd'],q=0.50) 
print(Q2)
Q3 = np.quantile(df['salary_in_usd'],q=0.75) 
print(Q3)
Q4 = np.quantile(df['salary_in_usd'],q=1) 
print(Q4)

62726.0
101570.0
150000.0
600000

In [127]:
IQR = Q3-Q1
print(IQR)
QCD = Q3-Q1/Q3+Q1
print(QCD)

87274.0
212725.58182666666

In [128]:
#DATASET2
titanic = pd.read_csv(r"C:\Users\pc\Desktop\__pycache__\seaborn-data\titanic.csv")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [129]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [130]:
fare_std=titanic['fare'].std()
fare_mean=titanic['fare'].mean()
print(fare_std)
print(fare_mean)

49.693428597180905
32.204207968574636

In [131]:
fst_std_upperbound= fare_mean + fare_std
print(fst_std_upperbound)
fst_std_lowerbound=fare_mean - fare_std
print(fst_std_lowerbound)

81.89763656575553
-17.48922062860627

COEFFICIENT OF VARIANCE

In [110]:
cv= fare_std/fare_mean
cv

1.54307252784085

In [111]:
Q1 = np.quantile(df['fare'],q=0.25) 
print(Q1)
Q2 = np.quantile(df['fare'],q=0.50) 
print(Q2)
Q3 = np.quantile(df['fare'],q=0.75) 
print(Q3)
Q4 = np.quantile(df['fare'],q=1) 
print(Q4)

7.9104
14.4542
31.0
512.3292

IQR - INTER QUARTILE RANGE

In [132]:
IQR = Q3-Q1
print(IQR)

87274.0

QCD - QUARTILE COEFFICIENT OF DISPERSION

In [133]:
QCD = Q3-Q1/Q3+Q1
print(QCD)

212725.58182666666

In [136]:
#DATASET 3
"C:\Users\pc\Desktop\__pycache__\seaborn-data\Housing.csv"
tips=pd.read_csv(r"C:\Users\pc\Desktop\__pycache__\seaborn-data\tips.csv")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [149]:
tip_mean=tips['total_bill'].mean()
tip_mean

19.78594262295082

In [150]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

STANDARD DEVIATION

In [151]:
tip_std=np.std(tips['tip'])
print(tip_std)
fst_std_upperbound= tip_mean + tip_std
print(fst_std_upperbound)
fst_std_lowerbound=tip_mean - tip_std
print(fst_std_lowerbound)

1.3807999538298958
21.166742576780717
18.405142669120924

COEFFICIENT OF VARIANCE

In [167]:
cv_tip= tip_std/tip_mean
cv_tip

0.06978691792162729

QUARTILES

In [168]:
Q1 = np.quantile(tips['tip'],q=0.25) 
print(Q1)
Q2 = np.quantile(tips['tip'],q=0.50) 
print(Q2)
Q3 = np.quantile(tips['tip'],q=0.75) 
print(Q3)
Q4 = np.quantile(tips['tip'],q=1) 
print(Q4)

2.0
2.9
3.5625
10.0

IQR - INTER QUARTILE RANGE

In [169]:
IQR = Q3-Q1
print(IQR)

1.5625

QCD - QUARTILE COEFFICIENT OF DISPERSION

In [170]:
QCD = Q3-Q1/Q3+Q1
print(QCD)

5.00109649122807

In [171]:
total_bill_mean = tips['total_bill'].mean()
total_bill_mean

19.78594262295082

In [172]:
total_bill_std = tips['total_bill'].std()
total_bill_std

8.902411954856856

In [174]:
cv_total_bill = total_bill_std/total_bill_mean
cv_total_bill

0.44993620594706724

In [175]:
print(f"Coefficient of variation for the tip: {cv_tip}")
print(f"Coefficient of variation for the total bill: {cv_total_bill}")

Coefficient of variation for the tip: 0.06978691792162729
Coefficient of variation for the total bill: 0.44993620594706724

In [176]:
#dataset 4
housing = pd.read_csv(r"C:\Users\pc\Desktop\__pycache__\seaborn-data\Housing.csv")

In [177]:
housing

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished
...,...,...,...,...,...,...,...,...,...,...,...,...,...
540,1820000,3000,2,1,1,yes,no,yes,no,no,2,no,unfurnished
541,1767150,2400,3,1,1,no,no,no,no,no,0,no,semi-furnished
542,1750000,3620,2,1,1,yes,no,no,no,no,0,no,unfurnished
543,1750000,2910,3,1,1,no,no,no,no,no,0,no,furnished
544,1750000,3850,3,1,2,yes,no,no,no,no,0,no,unfurnished

In [178]:
from scipy import stats

In [179]:
stats.iqr(housing['price'])

2310000.0

In [183]:
Q1 = np.quantile(housing['price'],q=0.25) 
print(Q1)
Q2 = np.quantile(housing['price'],q=0.50) 
print(Q2)
Q3 = np.quantile(housing['price'],q=0.75) 
print(Q3)
Q4 = np.quantile(housing['price'],q=1) 
print(Q4)

IQR = Q3-Q1
print(IQR)

3430000.0
4340000.0
5740000.0
13300000
2310000.0

In [185]:
QCD = Q3-Q1/Q3+Q1
print(QCD)

9169999.402439024